PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/mtb-device-support-pse8xxgp/pdl/drivers/include/cy_wdt.h
/*******************************************************************************
* Function Name: Cy_WDT_IsEnabled
****************************************************************************//**
*
* Reports an enable/disable state of the Watchdog timer.
*
* \return
* - true - if the timer is enabled
* - false - if the timer is disabled
*
*******************************************************************************/
__STATIC_INLINE bool Cy_WDT_IsEnabled(void)
{
#if (defined (CY_IP_MXS40SRSS) && (CY_IP_MXS40SRSS_VERSION >= 2))
    return _FLD2BOOL(WDT_CTL_ENABLE, SRSS_WDT_CTL);
#else
    return _FLD2BOOL(SRSS_WDT_CTL_WDT_EN, SRSS_WDT_CTL);
#endif
}

#if defined (CY_IP_MXS28SRSS) || defined (CY_IP_MXS40SSRSS) || defined (CY_IP_MXS40SRSS) && (CY_IP_MXS40SRSS_VERSION < 2) || defined (CY_IP_MXS22SRSS)

/*******************************************************************************
* Function Name: Cy_WDT_GetMatch
****************************************************************************//**
*
* Reads the WDT counter match comparison value.
*
* \return The counter match value.
*
*******************************************************************************/
__STATIC_INLINE uint32_t Cy_WDT_GetMatch(void)
{
    return ((uint32_t) _FLD2VAL(SRSS_WDT_MATCH_MATCH, SRSS_WDT_MATCH));
}

/*******************************************************************************
* Function Name: Cy_WDT_GetIgnoreBits
****************************************************************************//**
*
* Reads the number of the most significant bits of the Watchdog timer that are
* not checked against the match.
*
* \return The number of the most significant bits.
*
*******************************************************************************/
__STATIC_INLINE uint32_t Cy_WDT_GetIgnoreBits(void)
{
#if defined (CY_IP_MXS40SSRSS) || defined (CY_IP_MXS22SRSS)
    return ((uint32_t)(WDT_MAX_IGNORE_BITS - _FLD2VAL(SRSS_WDT_MATCH2_IGNORE_BITS_ABOVE, SRSS_WDT_MATCH2)));
#else
    return ((uint32_t) _FLD2VAL(SRSS_WDT_MATCH_IGNORE_BITS, SRSS_WDT_MATCH));
#endif
}

#if defined (CY_IP_MXS40SSRSS) || defined (CY_IP_MXS22SRSS) || defined (CY_DOXYGEN)
/*******************************************************************************
* Function Name: Cy_WDT_SetClkSource
****************************************************************************//**
*
* Configures the WDT clock source
*
* \param src
* \ref cy_en_wdt_clk_sources_t
*
* \note  It takes four cycles of the originally selected clock to switch away
* from it.  Do not disable the original clock during this time.
*
*******************************************************************************/
__STATIC_INLINE void Cy_WDT_SetClkSource(cy_en_wdt_clk_sources_t src)
{
    CY_ASSERT_L2(CY_WDT_IS_CLK_SRC_VALID(src));

    if (false == Cy_WDT_Locked())
    {
        SRSS_WDT_CTL = _CLR_SET_FLD32U((SRSS_WDT_CTL), SRSS_WDT_CTL_WDT_CLK_SEL, src);
        /** Adding 4 cycle delay */
        Cy_SysLib_DelayUs((uint16_t)CY_WDT_SRC_CLK_SWITCH_DELAY);
    }
}

/*******************************************************************************
* Function Name: Cy_WDT_GetClkSource
****************************************************************************//**
*
* Gets the WDT clock source configured.
*
* \return The Clock source enum \ref cy_en_wdt_clk_sources_t
*
*******************************************************************************/
__STATIC_INLINE cy_en_wdt_clk_sources_t Cy_WDT_GetClkSource(void)
{
    CY_MISRA_DEVIATE_LINE('MISRA C-2012 Rule 10.8', 'Intentional typecast to cy_en_wdt_clk_sources_t enum.');
    return ((cy_en_wdt_clk_sources_t) _FLD2VAL(SRSS_WDT_CTL_WDT_CLK_SEL, SRSS_WDT_CTL));
}

/*******************************************************************************
* Function Name: Cy_WDT_GetMatchBits
****************************************************************************//**
*
* Gets the bit position above which the bits will be ignored for match.
*
* \return The bit position above which the bits will be ignored for match.
*
*******************************************************************************/
__STATIC_INLINE uint32_t Cy_WDT_GetMatchBits(void)
{
    return ((uint32_t)(_FLD2VAL(SRSS_WDT_MATCH2_IGNORE_BITS_ABOVE, SRSS_WDT_MATCH2)));
}
#endif

#endif /*defined (CY_IP_MXS28SRSS) || defined (CY_IP_MXS40SSRSS) || defined (CY_IP_MXS40SRSS) && (CY_IP_MXS40SRSS_VERSION < 2) */


/*******************************************************************************
* Function Name: Cy_WDT_GetCount
****************************************************************************//**
*
* Reads the current WDT counter value.
*
* \return A live counter value.
*
*******************************************************************************/
__STATIC_INLINE uint32_t Cy_WDT_GetCount(void)
{
#if (defined (CY_IP_MXS40SRSS) && (CY_IP_MXS40SRSS_VERSION >= 2))
    return ((uint32_t) _FLD2VAL(WDT_CNT_CNT, SRSS_WDT_CNT));
#else
    return ((uint32_t) _FLD2VAL(SRSS_WDT_CNT_COUNTER, SRSS_WDT_CNT));
#endif
}

/*******************************************************************************
* Function Name: Cy_WDT_ResetCounter
****************************************************************************//**
*
* Resets the WDT counter value.
*
* \note
* This API must be called only after WDT is disabled, else the writes will be
* ignored if WDT is enabled.
*
*
*******************************************************************************/
__STATIC_INLINE void Cy_WDT_ResetCounter(void)
{
    SRSS_WDT_CNT = 0x0U;
}

/*******************************************************************************
* Function Name: Cy_WDT_MaskInterrupt
****************************************************************************//**
*
* After masking interrupts from the WDT, they are not passed to the CPU.
* This function does not disable the WDT-reset generation.
*
*******************************************************************************/
__STATIC_INLINE void Cy_WDT_MaskInterrupt(void)
{
#if (defined (CY_IP_MXS40SRSS) && (CY_IP_MXS40SRSS_VERSION >= 2))
    SRSS_WDT_INTR_MASK &= ~WDT_INTR_MASK_WDT_Msk;
#else
#if CY_CPU_CORTEX_M4 && defined(CY_DEVICE_SECURE)
    CY_PRA_REG32_CLR_SET(CY_PRA_INDX_SRSS_SRSS_INTR_MASK, SRSS_SRSS_INTR_MASK_WDT_MATCH, 0U);
#else
    SRSS_SRSS_INTR_MASK &= (uint32_t)(~ _VAL2FLD(SRSS_SRSS_INTR_MASK_WDT_MATCH, 1U));
#endif /* CY_CPU_CORTEX_M4 && defined(CY_DEVICE_SECURE) */
#endif
}


/*******************************************************************************
* Function Name: Cy_WDT_UnmaskInterrupt
****************************************************************************//**
*
* After unmasking interrupts from the WDT, they are passed to CPU.
* This function does not impact the reset generation.
*
*******************************************************************************/
__STATIC_INLINE void Cy_WDT_UnmaskInterrupt(void)
{
#if (defined (CY_IP_MXS40SRSS) && (CY_IP_MXS40SRSS_VERSION >= 2))
    SRSS_WDT_INTR_MASK |= WDT_INTR_MASK_WDT_Msk;
#else
#if CY_CPU_CORTEX_M4 && defined(CY_DEVICE_SECURE)
    CY_PRA_REG32_CLR_SET(CY_PRA_INDX_SRSS_SRSS_INTR_MASK, SRSS_SRSS_INTR_MASK_WDT_MATCH, 1U);
#else
    SRSS_SRSS_INTR_MASK |= _VAL2FLD(SRSS_SRSS_INTR_MASK_WDT_MATCH, 1U);
#endif /* CY_CPU_CORTEX_M4 && defined(CY_DEVICE_SECURE) */
#endif
}
/** \} group_wdt_functions */

#if defined(__cplusplus)
}
#endif

#endif /* CY_IP_MXS28SRSS, CY_IP_MXS40SRSS */

#endif /* CY_WDT_H */

/** \} group_wdt */


/* [] END OF FILE */
